# SetLinkHeightToLayerDeltaZ

## Description
_Vectorworks 2012 Deprecated Functions_. See architectural category for replacement:
:DelObjStoryBound
:DelObjStoryBounds
:GetObjBoundElevation
:GetObjStoryBound
:GetObjStoryBoundsAt
:GetObjStoryBoundsCnt
:GetStoryLayerInfo
:HasObjStoryBound
:HasObjStoryBounds
:SetObjectStoryBound

Sets whether or not the wall's height is linked to the layer delta z.

```pascal
FUNCTION SetLinkHeightToLayerDeltaZ(
				theWall           : HANDLE;
				linkToLayerDeltaZ : BOOLEAN): BOOLEAN;
```

```python
def vs.SetLinkHeightToLayerDeltaZ(theWall, linkToLayerDeltaZ):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|theWall|HANDLE|The wall.|
|linkToLayerDeltaZ|BOOLEAN|Whether or not the wall's height is linked to the layer delta z.|

## Examples
```pascal
resultOK := SetLinkHeightToLayerDeltaZ(theWall, TRUE);
```
```python
import vs

# _Vectorworks 2012 Deprecated Functions_.
theWall = vs.FSActLayer()  # handle to the first selected object on the active layer
linkToLayerDeltaZ = True

ok = vs.SetLinkHeightToLayerDeltaZ(theWall, linkToLayerDeltaZ)
if ok:
    vs.Message('SetLinkHeightToLayerDeltaZ succeeded')
else:
    vs.Message('SetLinkHeightToLayerDeltaZ failed')
```

## See Also
VS Functions:
GetLinkHeightToLayerDeltaZ

## Version
Availability: from VectorWorks12.5
Deprecated: Vectorworks 2012 Deprecated Functions

## Category
* Objects - Walls